/*--------------------------------------------------------------------------------------------------
|
| -> Слушать любой текст
|
|-------------------------------------------------------------------------------------------------*/

$.Bot.text(function(User) {
// Удаляем присланное сообщение от пользователя
    this.remove();
    
// Отправляем сообщение от бота
    //this.send(this.text)
    this.send()
    
// Сохраняем ID отправленного сообщения
    .then(function({ message_id }) {
        User.setMessageID(message_id);
    });
});

//--------------------------------------------------------------------------------------------------

// Если вы напишите 'inline_keyboard1', то бот отправит встроенную клавиатуру
$.Bot.text('inline_keyboard1', function() {
    this.send('Пример встроенной клавиатуры!', [
    // Ряд 1
        ['Кнопка #1','but_1'], ['Кнопка #2','but_2']
    ]);
});

// Если вы напишите 'inline_keyboard2', то бот отправит встроенную клавиатуру
$.Bot.text('inline_keyboard2', function() {
    this.send('Пример встроенной клавиатуры!', [
    // Ряд 1
        [['Кнопка #1','but_1'], ['Кнопка #2','but_2'], ['Кнопка #3','but_3']],
        
    // Ряд 2
        [['Кнопка #4','but_4']],
        
    // Ряд 3
        [['Кнопка #5','but_5'], ['Кнопка #6','but_6'], ['Кнопка #7','but_7'], ['Кнопка #8','but_8']]
    ]);
});

//--------------------------------------------------------------------------------------------------

// Если вы напишите 'keyboard1', то бот отправит клавиатуру
$.Bot.text('keyboard1', function() {
    this.send('Пример клавиатуры!', [
    // Ряд 1
        [['Кнопка #1'], ['Кнопка #2']]
    ]);
});

// Если вы напишите 'keyboard2', то бот отправит клавиатуру
$.Bot.text('keyboard2', function() {
    this.send('Пример клавиатуры!', [
    // Ряд 1
        [['Кнопка #1'], ['Кнопка #2'], ['Кнопка #3']],
        
    // Ряд 2
        [['Кнопка #4']],
        
    // Ряд 3
        [['Кнопка #5'], ['Кнопка #6'], ['Кнопка #7'], ['Кнопка #8']]
    ]);
});

//--------------------------------------------------------------------------------------------------

// Обработчик кнопки 'Удалить'
$.Bot.action('del', function() {
    this.remove();
});

// Обработчик всех кнопок
$.Bot.action(/.+/, function() {
    this.edit('Вы нажали: '+this.match, [['Удалить','del']]);
});

/*--------------------------------------------------------------------------------------------------
|
| -> Примеры слушателей
|
|-------------------------------------------------------------------------------------------------*/

// "/test"  -> 1 = Вы отправили команду "/test"!
// "/test2" -> 2 = Вы отправили команду "/test2"!
// "hello"  -> 3 = Вы отправили текст "hello"!
// "hello2" -> 4 = Вы отправили текст "hello2"!

// Слушает комманду "/test"
$.Bot.command('test', function(msg, User) {
    console.log('1 = Вы отправили команду "/'+msg.command+'"!');
});

// Слушать все комманды
$.Bot.command(function(msg, User) {
    console.log('2 = Вы отправили команду "/'+msg.command+'"!');
});

// Слушать текст "hello"
$.Bot.text('hello', function(msg, User) {
    console.log('3 = Вы отправили текст "'+msg.text+'"!');
});

// Слушать любой текст
$.Bot.text(function(msg, User) {
    console.log('4 = Вы отправили текст "'+msg.text+'"!');
});

//--------------------------------------------------------------------------------------------------