/*--------------------------------------------------------------------------------------------------
|
| -> Пример работы: "__=" и "__="
|
|    Отличие:
|    "_="  — Просто выводит текст в консоль.
|    "__=" — Все тоже самое, плюс process.exit()
|
|-------------------------------------------------------------------------------------------------*/

_= 'Hello world!'
_= 'test1'

__= 'Hello world and exit!'
__= 'test2'// "test2" не будет выведен в консоль

/*

Вывод:
Hello world!
test1
Hello world and exit!

*/

//--------------------------------------------------------------------------------------------------