/*--------------------------------------------------------------------------------------------------
|
| -> Любой текст
|
|-------------------------------------------------------------------------------------------------*/

$.Bot.on('text', function(ctx, User, Extra) {
// Удаляем присланное сообщение
    ctx.deleteMessage(ctx['message_id']);
    
// Первое сообщение
    ctx.reply(ctx.message['text'])
    
// Сохраняем ID последнего сообщения
    .then(function(ctx) {
        User.setMessageID(ctx['message_id']);
    });
});

//--------------------------------------------------------------------------------------------------

$.Bot.launch();

//--------------------------------------------------------------------------------------------------