//--------------------------------------------------------------------------------------------------

$.Bot.onStart(function() {
    this.send('Начинаю запуск...');
});

$.Bot.onHelp(function() {
    this.send('Высылаю помощь...');
});

$.Bot.onSettings(function() {
    this.send('Загружаю настройки...');
});

$.Bot.onCommand('test', function() {
    this.send('Запускаю тест!');
});

$.Bot.onCommand(function() {
    this.send(`Вы отправили команду:\n/${this.command}`);
});

//--------------------------------------------------------------------------------------------------