//--------------------------------------------------------------------------------------------------

require('../../src/app.init')(
// Базовые модули
    [
        'Bot'// Модуль для работы с телеграм ботом
    ],
    
// Пользовательские модули
    [
        './events.js'// Обработчики
    ]
);

//--------------------------------------------------------------------------------------------------

$.Bot.token = process.env.BOT_TOKEN||'1234567890:AbCdefGhIJKlmNoPQRsTUVwxyZ';
$.Bot.launch();// Запускаем бота

//--------------------------------------------------------------------------------------------------