/*--------------------------------------------------------------------------------------------------
|
| -> Код любого спец.символа можно найти в этой таблице:
|    https://ascii.cl/htmlcodes.htm
|
|-------------------------------------------------------------------------------------------------*/

// Список кодов спец.символов которые будем экранировать
var codes = [
    34,// "
    38,// &
    39,// '
    47,// /
    60,// <
    61,// =
    62,// >
    96 // `
];

// Создаем таблицу спец.символов
var chars = {};
var char = '';
var reg = '';

// Заполняем таблицу спец.символов
for (var i = 0; i < codes.length; i++) {
    char = String.fromCodePoint(codes[i]);
    chars[char] = codes[i];
    reg += char;
}

// Создаем регулярное выражение
reg = new RegExp('['+reg+']', 'g');

// Возвращаем функцию
module.exports = function(str) {
// Поиск спец.символов
    return (typeof str == 'string' ? str : ''+str).replace(reg, function(char) {
    // Экранируем спец.символы
        return '&#'+chars[char]+';';
    });
};

//--------------------------------------------------------------------------------------------------